# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for Pandas (v 2.x.x, as of this writing) but may take a little more than 10 minutes to finish. Lot's of small changes, references etc.

You can also open this notebook in Google Colab

<a href="https://colab.research.google.com/github/shauryashaurya/learn-data-munging/blob/main/02-Pandas/01.01-10%2B-minutes-to-Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.26.0'

In [3]:
pd.__version__

'2.1.1'

# Object creation

In [4]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [5]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [6]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range("20220619", periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [7]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-23 -2.170105 -1.442093  0.403281  0.216700
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087
2022-06-25  0.575393  0.543238  0.815611 -0.476902
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [8]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3] * 6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo",
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [9]:
# the datatype of each of the columns would be different
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
G           object
dtype: object

# Viewing Data

In [10]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-23 -2.170105 -1.442093  0.403281  0.216700

In [11]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [12]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [13]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
# NumPy arrays support a single data type
# so with mixed data types, the data type of
# each element is
df.to_numpy()

array([[-0.16155383,  0.7801087 , -1.71605198, -0.80025534],
       [-0.80167932,  0.02602592, -0.7653674 ,  0.32754998],
       [ 1.05439522,  0.10785889,  1.36805948, -0.44581065],
       [-1.40363445,  0.2233484 , -0.88452566,  0.19588564],
       [-2.1701052 , -1.44209293,  0.40328056,  0.2167001 ],
       [-0.2737351 , -1.55572138,  0.49411986, -1.17508734],
       [ 0.57539342,  0.54323754,  0.81561102, -0.47690152],
       [ 0.27748564,  0.75333925, -1.81365486,  1.22387508],
       [-0.92004061, -0.37080179, -2.39811112,  0.58126532],
       [ 1.05725275,  0.09695086,  0.33330723,  1.16019935]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [16]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.276622  -0.083775  -0.416333   0.080742
std     1.061558   0.823947   1.276917   0.799767
min    -2.170105  -1.555721  -2.398111  -1.175087
25%    -0.890450  -0.271595  -1.508170  -0.469129
50%    -0.217644   0.102405  -0.216030   0.206293
75%     0.500916   0.463265   0.471410   0.517836
max     1.057253   0.780109   1.368059   1.223875

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [17]:
# change the percentiles
df.describe(percentiles=[0.1, 0.5, 0.9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.276622  -0.083775  -0.416333   0.080742
std     1.061558   0.823947   1.276917   0.799767
min    -2.170105  -1.555721  -2.398111  -1.175087
10%    -1.480282  -1.453456  -1.872100  -0.837739
50%    -0.217644   0.102405  -0.216030   0.206293
90%     1.054681   0.756016   0.870856   1.166567
max     1.057253   0.780109   1.368059   1.223875

In [18]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A                    B    C    D
count  6.0                    6  6.0  6.0
mean   1.0  2022-06-19 00:00:00  1.0  3.0
min    1.0  2022-06-19 00:00:00  1.0  3.0
25%    1.0  2022-06-19 00:00:00  1.0  3.0
50%    1.0  2022-06-19 00:00:00  1.0  3.0
75%    1.0  2022-06-19 00:00:00  1.0  3.0
max    1.0  2022-06-19 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [19]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,-0.161554,-0.801679,1.054395,-1.403634,-2.170105,-0.273735,0.575393,0.277486,-0.920041,1.057253
B,0.780109,0.026026,0.107859,0.223348,-1.442093,-1.555721,0.543238,0.753339,-0.370802,0.096951
C,-1.716052,-0.765367,1.368059,-0.884526,0.403281,0.494120,0.815611,-1.813655,-2.398111,0.333307
D,-0.800255,0.327550,-0.445811,0.195886,0.216700,-1.175087,-0.476902,1.223875,0.581265,1.160199

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [20]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19 -0.800255 -1.716052  0.780109 -0.161554
2022-06-20  0.327550 -0.765367  0.026026 -0.801679
2022-06-21 -0.445811  1.368059  0.107859  1.054395
2022-06-22  0.195886 -0.884526  0.223348 -1.403634
2022-06-23  0.216700  0.403281 -1.442093 -2.170105
2022-06-24 -1.175087  0.494120 -1.555721 -0.273735
2022-06-25 -0.476902  0.815611  0.543238  0.575393
2022-06-26  1.223875 -1.813655  0.753339  0.277486
2022-06-27  0.581265 -2.398111 -0.370802 -0.920041
2022-06-28  1.160199  0.333307  0.096951  1.057253

In [21]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28  1.057253  0.096951  0.333307  1.160199
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-25  0.575393  0.543238  0.815611 -0.476902
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087
2022-06-23 -2.170105 -1.442093  0.403281  0.216700
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255

In [22]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-23 -2.170105 -1.442093  0.403281  0.216700
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-25  0.575393  0.543238  0.815611 -0.476902
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [23]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [24]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [25]:
# selecting a single column returns a Series object
df["A"]

2022-06-19   -0.161554
2022-06-20   -0.801679
2022-06-21    1.054395
2022-06-22   -1.403634
2022-06-23   -2.170105
2022-06-24   -0.273735
2022-06-25    0.575393
2022-06-26    0.277486
2022-06-27   -0.920041
2022-06-28    1.057253
Freq: D, Name: A, dtype: float64

In [26]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-23 -2.170105 -1.442093  0.403281  0.216700

## Selection by label

In [27]:
# selecting based on a label
df.loc[dates[0]]

A   -0.161554
B    0.780109
C   -1.716052
D   -0.800255
Name: 2022-06-19 00:00:00, dtype: float64

In [28]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19 -0.161554  0.780109
2022-06-20 -0.801679  0.026026
2022-06-21  1.054395  0.107859
2022-06-22 -1.403634  0.223348
2022-06-23 -2.170105 -1.442093
2022-06-24 -0.273735 -1.555721
2022-06-25  0.575393  0.543238
2022-06-26  0.277486  0.753339
2022-06-27 -0.920041 -0.370802
2022-06-28  1.057253  0.096951

In [29]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A   -0.801679
B    0.026026
C   -0.765367
D    0.327550
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [30]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

-0.1615538253751502

In [31]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

-0.1615538253751502

## Selection by position

In [32]:
df.iloc[2]

A    1.054395
B    0.107859
C    1.368059
D   -0.445811
Name: 2022-06-21 00:00:00, dtype: float64

In [33]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20 -0.801679  0.026026
2022-06-21  1.054395  0.107859
2022-06-22 -1.403634  0.223348
2022-06-23 -2.170105 -1.442093

In [34]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19 -0.161554 -1.716052
2022-06-20 -0.801679 -0.765367
2022-06-21  1.054395  1.368059
2022-06-25  0.575393  0.815611

In [35]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19 -1.716052  0.780109 -0.161554 -1.716052
2022-06-20 -0.765367  0.026026 -0.801679 -0.765367
2022-06-21  1.368059  0.107859  1.054395  1.368059
2022-06-25  0.815611  0.543238  0.575393  0.815611

In [36]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-21  1.054395  0.107859  1.368059 -0.445811

In [37]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19 -1.716052 -0.800255
2022-06-20 -0.765367  0.327550
2022-06-21  1.368059 -0.445811
2022-06-22 -0.884526  0.195886
2022-06-23  0.403281  0.216700
2022-06-24  0.494120 -1.175087
2022-06-25  0.815611 -0.476902
2022-06-26 -1.813655  1.223875
2022-06-27 -2.398111  0.581265
2022-06-28  0.333307  1.160199

In [38]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255
2022-06-20 -0.801679  0.026026 -0.765367  0.327550
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-22 -1.403634  0.223348 -0.884526  0.195886
2022-06-23 -2.170105 -1.442093  0.403281  0.216700
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087
2022-06-25  0.575393  0.543238  0.815611 -0.476902
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [39]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

-0.7653674002156421

In [40]:
#
# method two: use iat
df.iat[1, 2]

-0.7653674002156421

## Boolean Indexing

In [41]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-21  1.054395  0.107859  1.368059 -0.445811
2022-06-25  0.575393  0.543238  0.815611 -0.476902
2022-06-26  0.277486  0.753339 -1.813655  1.223875
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [42]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19       NaN  0.780109       NaN       NaN
2022-06-20       NaN  0.026026       NaN  0.327550
2022-06-21  1.054395  0.107859  1.368059       NaN
2022-06-22       NaN  0.223348       NaN  0.195886
2022-06-23       NaN       NaN  0.403281  0.216700
2022-06-24       NaN       NaN  0.494120       NaN
2022-06-25  0.575393  0.543238  0.815611       NaN
2022-06-26  0.277486  0.753339       NaN  1.223875
2022-06-27       NaN       NaN       NaN  0.581265
2022-06-28  1.057253  0.096951  0.333307  1.160199

In [43]:
# add another column
df11 = df.copy()
df11["E"] = [
    "one",
    "two",
    "three",
    "four",
    "two",
    "five",
    "one",
    "two",
    "three",
    "four",
]
df11

                   A         B         C         D      E
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255    one
2022-06-20 -0.801679  0.026026 -0.765367  0.327550    two
2022-06-21  1.054395  0.107859  1.368059 -0.445811  three
2022-06-22 -1.403634  0.223348 -0.884526  0.195886   four
2022-06-23 -2.170105 -1.442093  0.403281  0.216700    two
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087   five
2022-06-25  0.575393  0.543238  0.815611 -0.476902    one
2022-06-26  0.277486  0.753339 -1.813655  1.223875    two
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265  three
2022-06-28  1.057253  0.096951  0.333307  1.160199   four

In [44]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20 -0.801679  0.026026 -0.765367  0.327550   two
2022-06-23 -2.170105 -1.442093  0.403281  0.216700   two
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087  five
2022-06-26  0.277486  0.753339 -1.813655  1.223875   two

## Setting values

In [45]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range("20220619", periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [46]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11
2022-06-20 -0.801679  0.026026 -0.765367  0.327550  12
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14
2022-06-23 -2.170105 -1.442093  0.403281  0.216700  15
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087  16
2022-06-25  0.575393  0.543238  0.815611 -0.476902  17
2022-06-26  0.277486  0.753339 -1.813655  1.223875  18
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265  19
2022-06-28  1.057253  0.096951  0.333307  1.160199  20

In [47]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11
2022-06-20 -0.801679  0.026026 -0.765367  0.327550  12
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14
2022-06-23 -2.170105 -1.442093  0.403281  0.216700  15
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087  16
2022-06-25  0.575393  0.543238  0.815611 -0.476902  17
2022-06-26  0.277486  0.753339 -1.813655  1.223875  18
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265  19
2022-06-28  1.057253  0.096951  0.333307  1.160199  20

In [48]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000 -1.716052 -0.800255  11
2022-06-20 -0.801679  0.026026 -0.765367  0.327550  12
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14
2022-06-23 -2.170105 -1.442093  0.403281  0.216700  15
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087  16
2022-06-25  0.575393  0.543238  0.815611 -0.476902  17
2022-06-26  0.277486  0.753339 -1.813655  1.223875  18
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265  19
2022-06-28  1.057253  0.096951  0.333307  1.160199  20

In [49]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5] * len(df))
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -1.716052  5.0  11
2022-06-20 -0.801679  0.026026 -0.765367  5.0  12
2022-06-21  1.054395  0.107859  1.368059  5.0  13
2022-06-22 -1.403634  0.223348 -0.884526  5.0  14
2022-06-23 -2.170105 -1.442093  0.403281  5.0  15
2022-06-24 -0.273735 -1.555721  0.494120  5.0  16
2022-06-25  0.575393  0.543238  0.815611  5.0  17
2022-06-26  0.277486  0.753339 -1.813655  5.0  18
2022-06-27 -0.920041 -0.370802 -2.398111  5.0  19
2022-06-28  1.057253  0.096951  0.333307  5.0  20

In [50]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -1.716052 -5.0 -11
2022-06-20 -0.801679 -0.026026 -0.765367 -5.0 -12
2022-06-21 -1.054395 -0.107859 -1.368059 -5.0 -13
2022-06-22 -1.403634 -0.223348 -0.884526 -5.0 -14
2022-06-23 -2.170105 -1.442093 -0.403281 -5.0 -15
2022-06-24 -0.273735 -1.555721 -0.494120 -5.0 -16
2022-06-25 -0.575393 -0.543238 -0.815611 -5.0 -17
2022-06-26 -0.277486 -0.753339 -1.813655 -5.0 -18
2022-06-27 -0.920041 -0.370802 -2.398111 -5.0 -19
2022-06-28 -1.057253 -0.096951 -0.333307 -5.0 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [51]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["G"])
df13

                   A         B         C         D   F   G
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11 NaN
2022-06-20 -0.801679  0.026026 -0.765367  0.327550  12 NaN
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13 NaN
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [52]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11  NaN
2022-06-20       NaN  0.026026 -0.765367  0.327550  12  0.0
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [53]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [54]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [55]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11  NaN
2022-06-20       NaN  0.026026 -0.765367  0.327550  12  0.0
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [56]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11  NaN
2022-06-20       NaN  0.026026 -0.765367  0.327550  12  0.0
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [57]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [58]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [59]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11  NaN
2022-06-20       NaN  0.026026 -0.765367  0.327550  12  0.0
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [60]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13  0.0
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14  0.0

In [61]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi * 1000)

                      A         B         C         D   F            G
2022-06-19    -0.161554  0.780109 -1.716052 -0.800255  11  3141.592654
2022-06-20  3141.592654  0.026026 -0.765367  0.327550  12     0.000000
2022-06-21     1.054395  0.107859  1.368059 -0.445811  13     0.000000
2022-06-22    -1.403634  0.223348 -0.884526  0.195886  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [62]:
# date range indexes
idx1 = pd.date_range("2022-01-01", periods=10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range("2022-01-03", periods=10)

In [63]:
# dataframes from indexes
d1 = pd.DataFrame(
    index=idx1,
    data={"A": np.random.rand(10), "B": np.random.randint(1, high=25, size=10)},
)

d2 = pd.DataFrame(
    index=idx2,
    data={"A": np.random.rand(10), "B": np.random.randint(1, high=25, size=10)},
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [64]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html


def render_df_side_by_side(a, b, a_title="", b_title=""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(
        a_title
    )
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(
        b_title
    )
    display_html(a_styler._repr_html_() + b_styler._repr_html_(), raw=True)

In [65]:
render_df_side_by_side(d1, d2)

,A,B
2022-01-01 00:00:00,0.903481,17
2022-01-02 00:00:00,0.860529,9
2022-01-03 00:00:00,0.341629,9
2022-01-04 00:00:00,0.500474,23
2022-01-05 00:00:00,0.548803,10
2022-01-06 00:00:00,0.852633,19
2022-01-07 00:00:00,0.071512,9
2022-01-08 00:00:00,0.665023,12
2022-01-09 00:00:00,0.811690,21
2022-01-10 00:00:00,0.590189,4
,A,B
2022-01-03 00:00:00,0.231301,24
2022-01-04 00:00:00,0.794938,8
2022-01-05 00:00:00,0.365418,21
2022-01-06 00:00:00,0.288303,1
2022-01-07 00:00:00,0.275777,14
2022-01-08 00:00:00,0.719903,21
2022-01-09 00:00:00,0.729015,1
2022-01-10 00:00:00,0.132025,18
2022-01-11 00:00:00,0.035142,6
2022-01-12 00:00:00,0.563783,23

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [66]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1 + d2
d4 = d1.sub(d2)  # equivalent to d1-d2
d5 = d1 * d2
d6 = d1.div(d2)

In [67]:
# indexs not present in the other dataframe get a NaN

# pandas v1.x
# d3.style.highlight_null(null_color='red')

# pandas v2.x+
d3.style.highlight_null(color="red")

In [68]:
# sub
d4.style.highlight_null(color="red")

In [69]:
# mul
d5.style.highlight_null(color="red")

In [70]:
# div
d6.style.highlight_null(color="red")

### removing the NaN values from the resultant dataframe

In [71]:
# the + operation is UNION of indexes
d31 = d1 + d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(color="red")

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [72]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join="outer")
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.903481,17.000000
2022-01-02 00:00:00,0.860529,9.000000
2022-01-03 00:00:00,0.341629,9.000000
2022-01-04 00:00:00,0.500474,23.000000
2022-01-05 00:00:00,0.548803,10.000000
2022-01-06 00:00:00,0.852633,19.000000
2022-01-07 00:00:00,0.071512,9.000000
2022-01-08 00:00:00,0.665023,12.000000
2022-01-09 00:00:00,0.811690,21.000000
2022-01-10 00:00:00,0.590189,4.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.231301,24.000000
2022-01-04 00:00:00,0.794938,8.000000
2022-01-05 00:00:00,0.365418,21.000000
2022-01-06 00:00:00,0.288303,1.000000
2022-01-07 00:00:00,0.275777,14.000000
2022-01-08 00:00:00,0.719903,21.000000
2022-01-09 00:00:00,0.729015,1.000000
2022-01-10 00:00:00,0.132025,18.000000
2022-01-11 00:00:00,0.035142,6.000000
2022-01-12 00:00:00,0.563783,23.000000

In [73]:
# inner join
left, right = d1.align(d2, join="inner")
render_df_side_by_side(d1, d2)

,A,B
2022-01-01 00:00:00,0.903481,17
2022-01-02 00:00:00,0.860529,9
2022-01-03 00:00:00,0.341629,9
2022-01-04 00:00:00,0.500474,23
2022-01-05 00:00:00,0.548803,10
2022-01-06 00:00:00,0.852633,19
2022-01-07 00:00:00,0.071512,9
2022-01-08 00:00:00,0.665023,12
2022-01-09 00:00:00,0.811690,21
2022-01-10 00:00:00,0.590189,4
,A,B
2022-01-03 00:00:00,0.231301,24
2022-01-04 00:00:00,0.794938,8
2022-01-05 00:00:00,0.365418,21
2022-01-06 00:00:00,0.288303,1
2022-01-07 00:00:00,0.275777,14
2022-01-08 00:00:00,0.719903,21
2022-01-09 00:00:00,0.729015,1
2022-01-10 00:00:00,0.132025,18
2022-01-11 00:00:00,0.035142,6
2022-01-12 00:00:00,0.563783,23

In [74]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join="outer", fill_value=-100)
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.903481,17
2022-01-02 00:00:00,0.860529,9
2022-01-03 00:00:00,0.341629,9
2022-01-04 00:00:00,0.500474,23
2022-01-05 00:00:00,0.548803,10
2022-01-06 00:00:00,0.852633,19
2022-01-07 00:00:00,0.071512,9
2022-01-08 00:00:00,0.665023,12
2022-01-09 00:00:00,0.811690,21
2022-01-10 00:00:00,0.590189,4
2022-01-11 00:00:00,-100.000000,-100
2022-01-12 00:00:00,-100.000000,-100
,A,B
2022-01-01 00:00:00,-100.000000,-100
2022-01-02 00:00:00,-100.000000,-100
2022-01-03 00:00:00,0.231301,24
2022-01-04 00:00:00,0.794938,8
2022-01-05 00:00:00,0.365418,21
2022-01-06 00:00:00,0.288303,1
2022-01-07 00:00:00,0.275777,14
2022-01-08 00:00:00,0.719903,21
2022-01-09 00:00:00,0.729015,1
2022-01-10 00:00:00,0.132025,18
2022-01-11 00:00:00,0.035142,6
2022-01-12 00:00:00,0.563783,23

In [75]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join="left")
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.903481,17
2022-01-02 00:00:00,0.860529,9
2022-01-03 00:00:00,0.341629,9
2022-01-04 00:00:00,0.500474,23
2022-01-05 00:00:00,0.548803,10
2022-01-06 00:00:00,0.852633,19
2022-01-07 00:00:00,0.071512,9
2022-01-08 00:00:00,0.665023,12
2022-01-09 00:00:00,0.811690,21
2022-01-10 00:00:00,0.590189,4
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.231301,24.000000
2022-01-04 00:00:00,0.794938,8.000000
2022-01-05 00:00:00,0.365418,21.000000
2022-01-06 00:00:00,0.288303,1.000000
2022-01-07 00:00:00,0.275777,14.000000
2022-01-08 00:00:00,0.719903,21.000000
2022-01-09 00:00:00,0.729015,1.000000
2022-01-10 00:00:00,0.132025,18.000000

In [76]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join="right")
render_df_side_by_side(left, right)

,A,B
2022-01-03 00:00:00,0.341629,9.000000
2022-01-04 00:00:00,0.500474,23.000000
2022-01-05 00:00:00,0.548803,10.000000
2022-01-06 00:00:00,0.852633,19.000000
2022-01-07 00:00:00,0.071512,9.000000
2022-01-08 00:00:00,0.665023,12.000000
2022-01-09 00:00:00,0.811690,21.000000
2022-01-10 00:00:00,0.590189,4.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-03 00:00:00,0.231301,24
2022-01-04 00:00:00,0.794938,8
2022-01-05 00:00:00,0.365418,21
2022-01-06 00:00:00,0.288303,1
2022-01-07 00:00:00,0.275777,14
2022-01-08 00:00:00,0.719903,21
2022-01-09 00:00:00,0.729015,1
2022-01-10 00:00:00,0.132025,18
2022-01-11 00:00:00,0.035142,6
2022-01-12 00:00:00,0.563783,23

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [77]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A    -0.276622
B    -0.083775
C    -0.416333
D     0.080742
F    15.500000
dtype: float64

In [78]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    1.820450
2022-06-20    2.157306
2022-06-21    3.016901
2022-06-22    2.426215
2022-06-23    2.401557
2022-06-24    2.697915
2022-06-25    3.691468
2022-06-26    3.688209
2022-06-27    3.178462
2022-06-28    4.529542
Freq: D, dtype: float64

## Apply

In [79]:
# apply custom lambdas
df.apply(lambda x: x.max() - x.min())

A    3.227358
B    2.335830
C    3.766171
D    2.398962
F    9.000000
dtype: float64

In [80]:
df

                   A         B         C         D   F
2022-06-19 -0.161554  0.780109 -1.716052 -0.800255  11
2022-06-20 -0.801679  0.026026 -0.765367  0.327550  12
2022-06-21  1.054395  0.107859  1.368059 -0.445811  13
2022-06-22 -1.403634  0.223348 -0.884526  0.195886  14
2022-06-23 -2.170105 -1.442093  0.403281  0.216700  15
2022-06-24 -0.273735 -1.555721  0.494120 -1.175087  16
2022-06-25  0.575393  0.543238  0.815611 -0.476902  17
2022-06-26  0.277486  0.753339 -1.813655  1.223875  18
2022-06-27 -0.920041 -0.370802 -2.398111  0.581265  19
2022-06-28  1.057253  0.096951  0.333307  1.160199  20

In [81]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

,A,B,C,D,F
2022-06-19 00:00:00,-0.161554,0.780109,-1.716052,-0.800255,11
2022-06-20 00:00:00,-0.801679,0.026026,-0.765367,0.327550,12
2022-06-21 00:00:00,1.054395,0.107859,1.368059,-0.445811,13
2022-06-22 00:00:00,-1.403634,0.223348,-0.884526,0.195886,14
2022-06-23 00:00:00,-2.170105,-1.442093,0.403281,0.216700,15
2022-06-24 00:00:00,-0.273735,-1.555721,0.494120,-1.175087,16
2022-06-25 00:00:00,0.575393,0.543238,0.815611,-0.476902,17
2022-06-26 00:00:00,0.277486,0.753339,-1.813655,1.223875,18
2022-06-27 00:00:00,-0.920041,-0.370802,-2.398111,0.581265,19
2022-06-28 00:00:00,1.057253,0.096951,0.333307,1.160199,20
,A,B,C,D,F
2022-06-19 00:00:00,-0.161554,0.780109,-1.716052,-0.800255,11
2022-06-20 00:00:00,-0.963233,0.806135,-2.481419,-0.472705,23
2022-06-21 00:00:00,0.091162,0.913994,-1.113360,-0.918516,36
2022-06-22 00:00:00,-1.312472,1.137342,-1.997886,-0.722630,50
2022-06-23 00:00:00,-3.482578,-0.304751,-1.594605,-0.505930,65
2022-06-24 00:00:00,-3.756313,-1.860472,-1.100485,-1.681018,81
2022-06-25 00:00:00,-3.180919,-1.317235,-0.284874,-2.157919,98
2022-06-26 00:00:00,-2.903434,-0.563896,-2.098529,-0.934044,116
2022-06-27 00:00:00,-3.823474,-0.934697,-4.496640,-0.352779,135
2022-06-28 00:00:00,-2.766221,-0.837747,-4.163333,0.807421,155

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [82]:
series1 = pd.Series(np.random.randint(0, 5, size=25))
series1.value_counts()

0    8
3    7
1    7
4    2
2    1
Name: count, dtype: int64

## String Methods

In [83]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split())  # split splits on whitespace by default

In [84]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        "og": str_series,
        "length": str_series.str.len(),
        "low": low,
        "up": up,
        "split_low_on_i": low.str.split(
            "i", expand=False
        ),  # expand = True will break this usecase, try elsewhere
        "replace_a_with_star_in_low": low.str.replace(
            "a", "*", case=False, regex=True
        ),  # yeah, you can mess with regular expns
    }
)

low_up_df.tail(10)

,og,length,low,up,split_low_on_i,replace_a_with_star_in_low
36,eXpreSsiONs,11,expressions,EXPRESSIONS,"[express, ons]",expressions
37,bY,2,by,BY,[by],by
38,DEfault,7,default,DEFAULT,[default],def*ult
39,(aND,4,(and,(AND,[(and],(*nd
40,In,2,in,IN,"[, n]",in
41,Some,4,some,SOME,[some],some
42,cases,5,cases,CASES,[cases],c*ses
43,AlwayS,6,always,ALWAYS,[always],*lw*ys
44,uSEs,4,uses,USES,[uses],uses
45,tHeM).,6,them).,THEM).,[them).],them).

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [85]:
# let's make some more dataframes
concatDF = pd.DataFrame(
    np.random.randn(10, 4)
)  # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display("broken DFs: ", pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

'broken DFs: '

[          0         1         2         3
 0  0.533320  1.335722  0.441955  0.781734
 1 -1.577649 -1.064618  0.186338 -0.983739
 2  0.989040 -0.120039  0.348547 -0.418675,
           0         1         2         3
 3  0.110863 -2.749372  0.933766 -1.136921
 4 -0.769617 -0.324856 -0.248470 -0.317666
 5 -1.817356 -0.128594  1.414193 -0.858098
 6 -0.966036  0.462087 -1.450937  1.342852,
           0         1         2         3
 7  2.243377 -0.419601 -0.250426  0.687115
 8 -0.387763 -0.122755  0.997458 -1.051615
 9  1.042432 -0.480239 -0.924921 -0.128279]

,0,1,2,3
0,0.533320,1.335722,0.441955,0.781734
1,-1.577649,-1.064618,0.186338,-0.983739
2,0.989040,-0.120039,0.348547,-0.418675
3,0.110863,-2.749372,0.933766,-1.136921
4,-0.769617,-0.324856,-0.248470,-0.317666
5,-1.817356,-0.128594,1.414193,-0.858098
6,-0.966036,0.462087,-1.450937,1.342852
7,2.243377,-0.419601,-0.250426,0.687115
8,-0.387763,-0.122755,0.997458,-1.051615
9,1.042432,-0.480239,-0.924921,-0.128279
,0,1,2,3
0,0.533320,1.335722,0.441955,0.781734
1,-1.577649,-1.064618,0.186338,-0.983739
2,0.989040,-0.120039,0.348547,-0.418675
3,0.110863,-2.749372,0.933766,-1.136921
4,-0.769617,-0.324856,-0.248470,-0.317666
5,-1.817356,-0.128594,1.414193,-0.858098
6,-0.966036,0.462087,-1.450937,1.342852
7,2.243377,-0.419601,-0.250426,0.687115
8,-0.387763,-0.122755,0.997458,-1.051615
9,1.042432,-0.480239,-0.924921,-0.128279

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [86]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame({"key": list("ABCDEF"), "lval": sl})

right = pd.DataFrame({"key": list("ABBCDE"), "rval": sr})

In [87]:
render_df_side_by_side(left, right, "left", "right")

,key,lval
0,A,1
1,B,5
2,C,6
3,D,6
4,E,7
5,F,7
,key,rval
0,A,0
1,B,0
2,B,1
3,C,5
4,D,6
5,E,6

In [88]:
result = pd.merge(left, right, on="key")
result

  key  lval  rval
0   A     1     0
1   B     5     0
2   B     5     1
3   C     6     5
4   D     6     6
5   E     7     6

# Grouping

"Group By" really means one or more of the following happening:
1. **Split**: data is broken into groups based on some criteria
2. **Apply**: a data operation is executed on each of those groups
3. **Combine**: the results are combined back into a data structure

In [89]:
grp_df = pd.DataFrame(
    {
        "colA": list("AABCAABDAA"),
        "colB": list("1234567890"),
        "colC": np.random.randn(10),
        "colD": np.random.randn(10),
    }
)
grp_df

  colA colB      colC      colD
0    A    1 -0.127048  0.093000
1    A    2  0.038107  1.130463
2    B    3 -0.592078 -0.415108
3    C    4  0.511806 -0.979010
4    A    5 -0.513688 -1.706004
5    A    6  0.042700  0.731736
6    B    7 -0.431832  0.644149
7    D    8  0.152555  0.383412
8    A    9  0.040147 -0.796725
9    A    0  1.365643 -0.525948

In [90]:
# a DataFrameGroupBy object object
grpby = grp_df.groupby("colA")

# list all the groups found
g = grpby.groups
g

{'A': [0, 1, 4, 5, 8, 9], 'B': [2, 6], 'C': [3], 'D': [7]}

In [91]:
# to create a dataframe from the group use something like
grpby.get_group("A")

  colA colB      colC      colD
0    A    1 -0.127048  0.093000
1    A    2  0.038107  1.130463
4    A    5 -0.513688 -1.706004
5    A    6  0.042700  0.731736
8    A    9  0.040147 -0.796725
9    A    0  1.365643 -0.525948

### Find all the groups

In [92]:
# but we may not know all the groups in the dataframe.
# so got to find a way to list all groups as dataframes.
#
# some basic python helps create a list of groupby names
grpby_labels_list = [*g.keys()]  # using the unpacking operator *
# alternatively
# grpby_labels_list = list(g.keys())
grpby_labels_list

['A', 'B', 'C', 'D']

In [93]:
# create a dict where the group label is the key and the group dataframe is the value
grps = {lbl: grpby.get_group(lbl) for lbl in grpby_labels_list}

# now use the dict to access individual dataframes created out of the groupby operation
grps["B"]

# question: can we create a dataframe of dataframes?

  colA colB      colC      colD
2    B    3 -0.592078 -0.415108
6    B    7 -0.431832  0.644149

In [94]:
# You can see the datatype of the value is a pandas dataframe
type(grps["A"])

pandas.core.frame.DataFrame

In [95]:
# make a function of it all...
def get_all_groups(df_grpby):
    return {lbl: df_grpby.get_group(lbl) for lbl in list(df_grpby.groups.keys())}

In [96]:
grps = get_all_groups(grp_df.groupby("colA"))
grps

{'A':   colA colB      colC      colD
 0    A    1 -0.127048  0.093000
 1    A    2  0.038107  1.130463
 4    A    5 -0.513688 -1.706004
 5    A    6  0.042700  0.731736
 8    A    9  0.040147 -0.796725
 9    A    0  1.365643 -0.525948,
 'B':   colA colB      colC      colD
 2    B    3 -0.592078 -0.415108
 6    B    7 -0.431832  0.644149,
 'C':   colA colB      colC     colD
 3    C    4  0.511806 -0.97901,
 'D':   colA colB      colC      colD
 7    D    8  0.152555  0.383412}

In [97]:
# get a sum of values from each group
grp_df.groupby("colA").sum()

        colB      colC      colD
colA
A     125690  0.845860 -1.073477
B         37 -1.023910  0.229041
C          4  0.511806 -0.979010
D          8  0.152555  0.383412

In [98]:
# let's add one more column to the dataframe
# we can try grouping on two columns
grp_df["colE"] = list("1231231231")
grp_df

  colA colB      colC      colD colE
0    A    1 -0.127048  0.093000    1
1    A    2  0.038107  1.130463    2
2    B    3 -0.592078 -0.415108    3
3    C    4  0.511806 -0.979010    1
4    A    5 -0.513688 -1.706004    2
5    A    6  0.042700  0.731736    3
6    B    7 -0.431832  0.644149    1
7    D    8  0.152555  0.383412    2
8    A    9  0.040147 -0.796725    3
9    A    0  1.365643 -0.525948    1

In [99]:
g2 = grp_df.groupby(["colA", "colE"])
grps2 = get_all_groups(g2)
grps2

{('A',
  '1'):   colA colB      colC      colD colE
 0    A    1 -0.127048  0.093000    1
 9    A    0  1.365643 -0.525948    1,
 ('A',
  '2'):   colA colB      colC      colD colE
 1    A    2  0.038107  1.130463    2
 4    A    5 -0.513688 -1.706004    2,
 ('A',
  '3'):   colA colB      colC      colD colE
 5    A    6  0.042700  0.731736    3
 8    A    9  0.040147 -0.796725    3,
 ('B',
  '1'):   colA colB      colC      colD colE
 6    B    7 -0.431832  0.644149    1,
 ('B',
  '3'):   colA colB      colC      colD colE
 2    B    3 -0.592078 -0.415108    3,
 ('C',
  '1'):   colA colB      colC     colD colE
 3    C    4  0.511806 -0.97901    1,
 ('D',
  '2'):   colA colB      colC      colD colE
 7    D    8  0.152555  0.383412    2}

In [100]:
render_df_side_by_side(grps2[("A", "1")], grps2[("A", "2")], "A,1", "A,2")

,colA,colB,colC,colD,colE
0,A,1,-0.127048,0.093000,1
9,A,0,1.365643,-0.525948,1
,colA,colB,colC,colD,colE
1,A,2,0.038107,1.130463,2
4,A,5,-0.513688,-1.706004,2

# Reshaping

Stacking and Pivot Tables.
This really warrants more practice, at least go through [the page](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#)

## Stacking

In [101]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

If the syntax [*expression](https://docs.python.org/dev/reference/expressions.html#calls) appears in the function call, expression must evaluate to an iterable. Elements from these iterables are treated as if they were additional positional arguments.

...although the *expression syntax may appear after explicit keyword arguments, it is processed before the keyword arguments (and any **expression arguments)

In [102]:
# starred expressions...
def f(a, b):
    print(a, " ", b)


f(
    b=1, *(2,)
)  # works, the tuple (iterable) is expanded, 2 is assigned to a, then b fills the next argument slot
# f (a=1, *(2,)) # FAILS, multiple values for argument 'a'

2   1

In [103]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [104]:
stack_idx = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [105]:
stack_df = pd.DataFrame(np.random.randn(8, 2), index=stack_idx, columns=["a", "b"])
stack_df

                     a         b
first second
bar   one     0.796701  1.669951
      two    -0.581483 -0.717920
baz   one    -0.277277  0.805624
      two    -0.294362 -0.264247
foo   one    -0.076507  0.989999
      two     0.189443 -1.929023
qux   one     1.163538  0.263025
      two     0.800597 -0.682234

In [106]:
# stack really just combines the columns
stacked = stack_df.stack()
stacked

first  second
bar    one     a    0.796701
               b    1.669951
       two     a   -0.581483
               b   -0.717920
baz    one     a   -0.277277
               b    0.805624
       two     a   -0.294362
               b   -0.264247
foo    one     a   -0.076507
               b    0.989999
       two     a    0.189443
               b   -1.929023
qux    one     a    1.163538
               b    0.263025
       two     a    0.800597
               b   -0.682234
dtype: float64

In [107]:
# unstacked brings back the two columns
# by default unstacks the last level
unstacked = stacked.unstack()
unstacked

                     a         b
first second
bar   one     0.796701  1.669951
      two    -0.581483 -0.717920
baz   one    -0.277277  0.805624
      two    -0.294362 -0.264247
foo   one    -0.076507  0.989999
      two     0.189443 -1.929023
qux   one     1.163538  0.263025
      two     0.800597 -0.682234

In [108]:
stacked.unstack(1)

second        one       two
first
bar   a  0.796701 -0.581483
      b  1.669951 -0.717920
baz   a -0.277277 -0.294362
      b  0.805624 -0.264247
foo   a -0.076507  0.189443
      b  0.989999 -1.929023
qux   a  1.163538  0.800597
      b  0.263025 -0.682234

In [109]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    a  0.796701 -0.277277 -0.076507  1.163538
       b  1.669951  0.805624  0.989999  0.263025
two    a -0.581483 -0.294362  0.189443  0.800597
       b -0.717920 -0.264247 -1.929023 -0.682234

In [110]:
# you can basically pivot the columns and rows using a combination of stack() and unstack()
unstacked.unstack()

               a                   b
second       one       two       one       two
first
bar     0.796701 -0.581483  1.669951 -0.717920
baz    -0.277277 -0.294362  0.805624 -0.264247
foo    -0.076507  0.189443  0.989999 -1.929023
qux     1.163538  0.800597  0.263025 -0.682234

## Pivot Tables

In [111]:
# we're now just using data created in the pandas documentation - just cause, time.
pivot_tables_df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pivot_tables_df

        A  B    C         D         E
0     one  A  foo -0.270786  0.743339
1     one  B  foo  0.348015  0.427104
2     two  C  foo -1.797046 -0.460178
3   three  A  bar -0.246865 -0.174089
4     one  B  bar -0.433718 -0.187302
5     one  C  bar  0.749680  0.328079
6     two  A  foo  0.534590  0.095463
7   three  B  foo  0.457922  0.324956
8     one  C  foo  1.575833  0.201381
9     one  A  bar  0.829713 -1.479981
10    two  B  bar -0.606439  0.356321
11  three  C  bar  0.529029 -1.618165

In [112]:
# simple pivot tables - data, values to aggregate, index, columns to pivot along
pd.pivot_table(pivot_tables_df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.829713 -0.270786
      B -0.433718  0.348015
      C  0.749680  1.575833
three A -0.246865       NaN
      B       NaN  0.457922
      C  0.529029       NaN
two   A       NaN  0.534590
      B -0.606439       NaN
      C       NaN -1.797046

In [113]:
# more'n one columns of values
# mark all NaN as zero (0)
pd.pivot_table(
    pivot_tables_df, values=["D", "E"], index=["A", "B"], columns=["C"]
).fillna(0)

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.829713 -0.270786 -1.479981  0.743339
      B -0.433718  0.348015 -0.187302  0.427104
      C  0.749680  1.575833  0.328079  0.201381
three A -0.246865  0.000000 -0.174089  0.000000
      B  0.000000  0.457922  0.000000  0.324956
      C  0.529029  0.000000 -1.618165  0.000000
two   A  0.000000  0.534590  0.000000  0.095463
      B -0.606439  0.000000  0.356321  0.000000
      C  0.000000 -1.797046  0.000000 -0.460178

# Time Series

## Resample
We may need to resample data to a different time-frequency. 
Like get data every second and resample to data every 5 minutes and so on...

In [114]:
rng = pd.date_range("01/01/2022", periods=1000, freq="S")

In [115]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [116]:
ts.resample("5min").sum()

2022-01-01 00:00:00    72252
2022-01-01 00:05:00    70600
2022-01-01 00:10:00    72674
2022-01-01 00:15:00    22072
Freq: 5T, dtype: int32

read up on [date offset strings](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects) like '5min' etc.

## Timezones

In [117]:
# timezone representation
rng2 = pd.date_range("01/01/2022", periods=500, freq="D")
ts2 = pd.Series(np.random.randint(0, 365, len(rng2)), index=rng2)
ts2_utc = ts2.tz_localize("UTC")

In [118]:
# convert to US/Eastern
ts2_utc.tz_convert("US/Eastern")

2021-12-31 19:00:00-05:00    138
2022-01-01 19:00:00-05:00    183
2022-01-02 19:00:00-05:00    214
2022-01-03 19:00:00-05:00      4
2022-01-04 19:00:00-05:00     66
                            ...
2023-05-10 20:00:00-04:00    281
2023-05-11 20:00:00-04:00    264
2023-05-12 20:00:00-04:00     36
2023-05-13 20:00:00-04:00    205
2023-05-14 20:00:00-04:00    178
Freq: D, Length: 500, dtype: int32

## Time span representations

Converting between periods and timestamps.

Period is a _timespan_ - span of time between two timestamps.

In [119]:
# month - end of each
rng3 = pd.date_range("01/01/2022", periods=12, freq="M")
rng3

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-31'],
              dtype='datetime64[ns]', freq='M')

In [120]:
ts3 = pd.Series(np.random.randn(len(rng3)), index=rng3)
ts3

2022-01-31   -1.071114
2022-02-28    0.285208
2022-03-31   -1.116327
2022-04-30    0.005264
2022-05-31    1.070088
2022-06-30    0.572551
2022-07-31    0.464445
2022-08-31   -0.656659
2022-09-30   -1.514287
2022-10-31    0.794882
2022-11-30   -0.732974
2022-12-31   -0.187715
Freq: M, dtype: float64

In [121]:
ps = ts3.to_period()
ps

2022-01   -1.071114
2022-02    0.285208
2022-03   -1.116327
2022-04    0.005264
2022-05    1.070088
2022-06    0.572551
2022-07    0.464445
2022-08   -0.656659
2022-09   -1.514287
2022-10    0.794882
2022-11   -0.732974
2022-12   -0.187715
Freq: M, dtype: float64

In [122]:
ps.to_timestamp()

2022-01-01   -1.071114
2022-02-01    0.285208
2022-03-01   -1.116327
2022-04-01    0.005264
2022-05-01    1.070088
2022-06-01    0.572551
2022-07-01    0.464445
2022-08-01   -0.656659
2022-09-01   -1.514287
2022-10-01    0.794882
2022-11-01   -0.732974
2022-12-01   -0.187715
Freq: MS, dtype: float64

A more complex use-case:
convert a _quarterly frequency_ with _year ending in November_ to _9am_ of _the end of the month_ _following_ the _quarter end_

In [123]:
prng = pd.period_range("1990Q1", "2022Q4", freq="Q-NOV")
type(prng)

pandas.core.indexes.period.PeriodIndex

In [124]:
ts4 = pd.Series(np.random.randn(len(prng)), index=prng)
ts4.head()

1990Q1   -0.966677
1990Q2   -0.533371
1990Q3    0.516920
1990Q4    0.536712
1991Q1   -0.620493
Freq: Q-NOV, dtype: float64

In [125]:
ts4.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9
ts4.head()

1990-03-01 09:00   -0.966677
1990-06-01 09:00   -0.533371
1990-09-01 09:00    0.516920
1990-12-01 09:00    0.536712
1991-03-01 09:00   -0.620493
Freq: H, dtype: float64

# Categoricals

[This page](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#categorical-data).

##### Note: With v2.0+ some of these are breaking - so this sections needs an update.  

See [this issue on GitHub](https://github.com/pandas-dev/pandas/issues/52593)

For e.g., gender, social class, blood type, country affiliation, observation time or rating via Likert scales.  

Categorical data. Categories allow (usually) fixed number of possible values. Categorical data may have some order, but not support numerical operations (for e.g., 'strongly agree', 'agree', 'disagree', 'strongly disagree').

In [126]:
cat_df = pd.DataFrame({"id": list("123456"), "raw_grade": list("abbaae")})
cat_df

  id raw_grade
0  1         a
1  2         b
2  3         b
3  4         a
4  5         a
5  6         e

In [127]:
# convert the raw_grade col to categories
cat_df["grade"] = cat_df["raw_grade"].astype("category")
cat_df

  id raw_grade grade
0  1         a     a
1  2         b     b
2  3         b     b
3  4         a     a
4  5         a     a
5  6         e     e

In [128]:
# list of categories
cat_df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [129]:
# this breaks with v2.0+
# [TODO] Find a fix

# can give more meaningful names here
# direct assignment to Series.cat.categories()
# cat_df["grade"].cat.categories = ["very good", "meh", "very bad"]
# cat_df["grade"]

In [130]:
cat_df

  id raw_grade grade
0  1         a     a
1  2         b     b
2  3         b     b
3  4         a     a
4  5         a     a
5  6         e     e

In [131]:
# list of categories
list(cat_df["grade"].cat.categories)

# categorical.CategoricalAccessor encapsulates all changes to categoricals
# for e.g., set_categories or remove_categories
# dir(cat_df['grade'].cat)

['a', 'b', 'e']

In [132]:
# add more categories
cat_df["grade"] = cat_df["grade"].cat.set_categories(
    ["very bad", "bad", "meh", "good", "very good"]
)
# new list of categories
list(cat_df["grade"].cat.categories)

['very bad', 'bad', 'meh', 'good', 'very good']

In [133]:
# now when we can sort the dataframe in order of categories (not lexical)
sorted_cat_df = cat_df.sort_values(by="grade")
render_df_side_by_side(cat_df, sorted_cat_df, "OG", "Sorted")

,id,raw_grade,grade
0,1,a,nan
1,2,b,nan
2,3,b,nan
3,4,a,nan
4,5,a,nan
5,6,e,nan
,id,raw_grade,grade
0,1,a,nan
1,2,b,nan
2,3,b,nan
3,4,a,nan
4,5,a,nan
5,6,e,nan

In [134]:
# grouping
# cat_grp = cat_df.groupby("grade")
# cat_grp.get_group("very good")

In [135]:
# count elements
# cat_grp.size()